case3/TemplateCase0.075/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.487804 -0.245242 0.005)
(-0.467894 -0.245242 0.005)
(-0.447983 -0.245242 0.005)
(-0.428073 -0.245242 0.005)
(-0.408163 -0.245242 0.005)
(-0.388252 -0.245242 0.005)
(-0.368342 -0.245242 0.005)
(-0.348431 -0.245242 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.497756 -0.245235 0.005)
(-0.493274 -0.235702 0.005)
(-0.488812 -0.226159 0.005)
(-0.484383 -0.216601 0.005)
(-0.480001 -0.207022 0.005)
(-0.475679 -0.197415 0.005)
(-0.471431 -0.187775 0.005)
(-0.467272 -0.178097 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.497756 -0.245235 0.005)
(0.493274 -0.235702 0.005)
(0.488812 -0.226159 0.005)
(0.484383 -0.216601 0.005)
(0.480001 -0.207022 0.005)
(0.475679 -0.197415 0.005)
(0.471431 -0.187775 0.005)
(0.467272 -0.178097 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
