case3/TemplateCase0.075/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.245242
-0.245242
-0.245242
-0.245242
-0.245242
-0.245242
-0.245242
-0.245242
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245235
-0.235702
-0.226159
-0.216601
-0.207022
-0.197415
-0.187775
-0.178097
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.245235
-0.235702
-0.226159
-0.216601
-0.207022
-0.197415
-0.187775
-0.178097
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.25
0.25
0.25
0.25
0.25
0.25
0.25
0.25
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
-0.25
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
